app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `username` = 'roby'
 LIMIT 1
---
    public function doLogin()
    {
        $session = session();
        $model = new UserModel();

        $user = $model->where('username', $this->request->getPost('username'))->first();