app/Controllers/Customer.php

SELECT *
FROM `customers`
---
    public function index()
    {
        $model = new CustomerModel();
        $data['customers'] = $model->findAll();