app/Controllers/Invoice.php

    public function index()
    {
        $builder = $this->db->table('invoices');
        $builder->select('invoices.*, customers.nama as customer_nama');
        $builder->join('customers', 'invoices.customer_id = customers.id', 'left');
        $builder->orderBy('tanggal', 'DESC');

        $data['invoices'] = $builder->get()->getResultArray();
---
SELECT `invoices`.*, `customers`.`nama` as `customer_nama`
FROM `invoices`
LEFT JOIN `customers` ON `invoices`.`customer_id` = `customers`.`id`
ORDER BY `tanggal` DESC