app/Controllers/Produk.php

    public function index()
    {
        $data['products'] = $this->produkModel->findAll();
---
SELECT *
FROM `products`