app/Controllers/ReportController.php

SELECT `invoices`.*, `invoices`.`status`, `customers`.`nama` as `customer_name`
FROM `invoices`
JOIN `customers` ON `customers`.`id` = `invoices`.`customer_id`
ORDER BY `tanggal` DESC
SELECT *
FROM `customers`
---
    public function index()
    {
        $invoiceModel = new InvoiceModel();
        $customerModel = new CustomerModel();
        $db = \Config\Database::connect();

        $customer_id = $this->request->getGet('customer_id');
        $status = $this->request->getGet('status');

        // Query invoice dengan join ke customer
        $query = $invoiceModel->select('invoices.*, invoices.status, customers.nama as customer_name')
        ->join('customers', 'customers.id = invoices.customer_id');

    if ($customer_id) {
        $query->where('customer_id', $customer_id);
    }

    if ($status) {
        $query->where('status', $status);
    }

    $invoices = $query->orderBy('tanggal', 'DESC')->findAll();

        $customers = $customerModel->findAll();